Revit 2026 API

# DuctFittingAndAccessoryPressureDropUIData Properties

---

The DuctFittingAndAccessoryPressureDropUIData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

DuctFittingAndAccessoryPressureDropUIData Class

Autodesk.Revit.UI.Mechanical Namespace